#+LATEX_HEADER_EXTRA: \usepackage{tikz-timing}[2009/12/09]
#+LATEX_HEADER_EXTRA: \usetikztiminglibrary[new={char=Q,reset char=R}]{counters}
#+LATEX_HEADER_EXTRA: \usetikzlibrary{shapes,arrows}
#+LATEX_HEADER_EXTRA: \usepackage[active,tightpage]{preview}
#+LATEX_HEADER_EXTRA: \setlength{\PreviewBorder}{5mm}

#+LATEX_HEADER_EXTRA: \definecolor{bgblue}{rgb}{0.5,0.9,0.9}
#+LATEX_HEADER_EXTRA: \definecolor{bgred}{rgb}{1,0.6,0.6}
#+LATEX_HEADER_EXTRA: \definecolor{fgblue}{rgb}{0,0,0.6}
#+LATEX_HEADER_EXTRA: \definecolor{bgred}{rgb}{0.6,,0}

*** DONE AUIPC
    CLOSED: [2017-03-13 Mon 10:13]
    :LOGBOOK:
    CLOCK: [2017-03-04 Sat 06:57]--[2017-03-04 Sat 07:08] =>  0:11
    :LOGBOOK:  
    CLOCK: [2017-03-02 Thu 14:00]--[2017-03-02 Thu 14:01] =>  0:01
    :END:      
    :PROPERTIES:
    :Effort:   0:30
    :END:
*** DONE LB
    CLOSED: [2017-02-20 Mon 11:19]
    :LOGBOOK:  
    CLOCK: [2017-02-20 Mon 10:10]--[2017-02-20 Mon 11:19] =>  1:09
    CLOCK: [2017-02-20 Mon 08:46]--[2017-02-20 Mon 08:58] =>  0:12
    :END:      
    :PROPERTIES:
    :Effort:   0:30
    :END:
*** DONE LH
    CLOSED: [2017-02-20 Mon 12:18]
    :LOGBOOK:
    CLOCK: [2017-02-20 Mon 12:02]--[2017-02-20 Mon 12:18] =>  0:16
    :END:
    :PROPERTIES:
    :Effort:   0:30
    :END:
*** DONE LBU
    CLOSED: [2017-02-27 Mon 08:06]
    :LOGBOOK:  
    CLOCK: [2017-02-27 Mon 07:48]--[2017-02-27 Mon 08:06] =>  0:18
    :END:      
    :PROPERTIES:
    :Effort:   0:30
    :END:
*** DONE LHU
    CLOSED: [2017-02-27 Mon 09:45]
    :LOGBOOK:  
    CLOCK: [2017-02-27 Mon 09:28]--[2017-02-27 Mon 09:45] =>  0:17
    :END:      
    :PROPERTIES:
    :Effort:   0:30
    :END:
*** DONE SB
    CLOSED: [2017-02-22 Wed 13:16]
    :LOGBOOK:  
    CLOCK: [2017-02-22 Wed 12:54]--[2017-02-22 Wed 13:16] =>  0:22
    CLOCK: [2017-02-21 Tue 07:51]--[2017-02-21 Tue 08:59] =>  1:08
    :END:      
    :PROPERTIES:
    :Effort:   0:30
    :END:
*** DONE SH
    CLOSED: [2017-02-23 Thu 09:15]
    :LOGBOOK:  
    CLOCK: [2017-02-23 Thu 08:33]--[2017-02-23 Thu 09:15] =>  0:42
    :END:      
    :PROPERTIES:
    :Effort:   0:15
    :END:
*** DONE ADDI
    CLOSED: [2017-02-13 Mon 12:28]
    :LOGBOOK:  
    CLOCK: [2017-02-13 Mon 10:23]--[2017-02-13 Mon 11:05] =>  0:42
    :END:      
    :PROPERTIES:
    :Effort:   0:30
    :END:
*** DONE SLTI
    CLOSED: [2017-02-16 Thu 18:50]
    :LOGBOOK:  
    CLOCK: [2017-02-16 Thu 18:24]--[2017-02-16 Thu 18:50] =>  0:26
    CLOCK: [2017-02-15 Wed 10:09]--[2017-02-15 Wed 10:52] =>  0:43
    :END:      
    :PROPERTIES:
    :Effort:   0:30
    :END:
*** DONE SLTIU
    CLOSED: [2017-02-16 Thu 19:02]
    :LOGBOOK:  
    CLOCK: [2017-02-16 Thu 18:50]--[2017-02-16 Thu 19:02] =>  0:12
    :END:      
    :PROPERTIES:
    :Effort:   0:30
    :END:
*** DONE XORI
    CLOSED: [2017-02-15 Wed 08:04]
    :LOGBOOK:  
    CLOCK: [2017-02-14 Tue 11:29]--[2017-02-14 Tue 12:45] =>  1:16
    :END:      
    :PROPERTIES:
    :Effort:   0:30
    :END:
*** DONE ORI
    CLOSED: [2017-02-05 Sun 17:55]
    :LOGBOOK:
    CLOCK: [2017-02-05 Sun 15:34]--[2017-02-05 Sun 17:56] =>  2:22
    :END:
*** DONE ANDI
    CLOSED: [2017-02-05 Sun 18:17]
    :LOGBOOK:
    CLOCK: [2017-02-05 Sun 17:57]--[2017-02-05 Sun 18:17] =>  0:20
    :END:
*** DONE SLLI
    CLOSED: [2017-02-05 Sun 20:16]
    :LOGBOOK:
    CLOCK: [2017-02-05 Sun 19:36]--[2017-02-05 Sun 20:16] =>  0:40
    :END:
*** DONE SRLI
    CLOSED: [2017-02-13 Mon 07:34]
    :LOGBOOK:
    CLOCK: [2017-02-13 Mon 07:34]--[2017-02-13 Mon 07:54] =>  0:20
    CLOCK: [2017-02-13 Mon 07:33]--[2017-02-13 Mon 07:34] =>  0:01
    :END:
    :PROPERTIES:
    :Effort:   0:30
    :END:
*** DONE SRAI
    CLOSED: [2017-02-13 Mon 08:55]
    :LOGBOOK:  
    CLOCK: [2017-02-13 Mon 07:54]--[2017-02-13 Mon 08:55] =>  1:01
    :END:      
    :PROPERTIES:
    :Effort:   0:30
    :END:
*** DONE SLL
    CLOSED: [2017-02-05 Sun 17:57]
    :LOGBOOK:  
    CLOCK: [2017-02-01 Wed 16:33]--[2017-02-01 Wed 17:57] =>  1:24
    :END:      
    :PROPERTIES:
    :Effort:   0:30
    :END:
*** DONE SLT
    CLOSED: [2017-02-20 Mon 08:18]
    :LOGBOOK:  
    CLOCK: [2017-02-17 Fri 08:00]--[2017-02-17 Fri 08:18] =>  0:18
    :END:      
    :PROPERTIES:
    :Effort:   0:30
    :END:
*** DONE SLTU
    CLOSED: [2017-02-20 Mon 08:45]
    :LOGBOOK:  
    CLOCK: [2017-02-20 Mon 08:45]--[2017-02-20 Mon 08:46] =>  0:01
    CLOCK: [2017-02-20 Mon 08:18]--[2017-02-20 Mon 08:45] =>  0:27
    :END:      
    :PROPERTIES:
    :Effort:   0:30
    :END:
*** DONE XOR
    CLOSED: [2017-02-15 Wed 09:04]
    :LOGBOOK:  
    CLOCK: [2017-02-15 Wed 08:04]--[2017-02-15 Wed 09:04] =>  1:00
    :END:      
    :PROPERTIES:
    :Effort:   0:30
    :END:
*** DONE SRL
    CLOSED: [2017-02-28 Tue 07:58]
    :LOGBOOK:  
    CLOCK: [2017-02-27 Mon 17:54]--[2017-02-27 Mon 18:11] =>  0:17
    :END:      
    :PROPERTIES:
    :Effort:   0:30
    :END:
*** DONE SRA
    CLOSED: [2017-02-28 Tue 08:51]
    :LOGBOOK:  
    CLOCK: [2017-02-28 Tue 08:00]--[2017-02-28 Tue 08:51] =>  0:51
    :END:      
    :PROPERTIES:
    :Effort:   0:30
    :END:
*** DONE OR
    CLOSED: [2017-02-15 Wed 09:13]
    :LOGBOOK:  
    CLOCK: [2017-02-15 Wed 09:13]--[2017-02-15 Wed 09:15] =>  0:02
    CLOCK: [2017-02-15 Wed 09:04]--[2017-02-15 Wed 09:13] =>  0:09
    :END:      
    :PROPERTIES:
    :Effort:   0:30
    :END:
*** DONE AND
    CLOSED: [2017-02-15 Wed 09:54]
    :LOGBOOK:  
    CLOCK: [2017-02-15 Wed 09:15]--[2017-02-15 Wed 09:26] =>  0:11
    :END:      
    :PROPERTIES:
    :Effort:   0:30
    :END:
** DONE add error handler in testbench
   CLOSED: [2017-02-15 Wed 09:30]
   :LOGBOOK:  
   CLOCK: [2017-02-15 Wed 09:30]--[2017-02-15 Wed 09:53] =>  0:23
   CLOCK: [2017-02-15 Wed 09:29]--[2017-02-15 Wed 09:30] =>  0:01
   :END:      
   :PROPERTIES:
   :Effort:   0:10
   :END:
** DONE add generating error in rtl
   CLOSED: [2017-02-15 Wed 09:29]
   :LOGBOOK:  
   CLOCK: [2017-02-15 Wed 09:26]--[2017-02-15 Wed 09:29] =>  0:03
   :END:      
   :PROPERTIES:
   :Effort:   0:10
   :END:
** DONE add support to labels in assembler
   CLOSED: [2017-03-01 Wed 11:28]
   :LOGBOOK:  
   CLOCK: [2017-03-01 Wed 09:21]--[2017-03-01 Wed 11:28] =>  2:07
   CLOCK: [2017-02-28 Tue 08:54]--[2017-02-28 Tue 08:58] =>  0:04
   :END:      
   :PROPERTIES:
   :Effort:   0:30
   :END:
** DONE add symbol table and program code array
   CLOSED: [2017-03-01 Wed 13:11]
   :LOGBOOK:  
   CLOCK: [2017-03-01 Wed 12:59]--[2017-03-01 Wed 13:11] =>  0:12
   CLOCK: [2017-03-01 Wed 11:31]--[2017-03-01 Wed 11:45] =>  0:14
   :END:      
   :PROPERTIES:
   :Effort:   1:00
   :END:
** DONE labels support to LUI
   CLOSED: [2017-03-09 Thu 11:17]
   :LOGBOOK:  
   CLOCK: [2017-03-08 Wed 09:02]--[2017-03-09 Thu 11:38] => 26:36
   :END:      
   :PROPERTIES:
   :Effort:   1:00
   :END:
*** DONE AUIPC
    CLOSED: [2017-03-09 Thu 12:20]
    :LOGBOOK:  
    CLOCK: [2017-03-09 Thu 11:38]--[2017-03-09 Thu 11:45] =>  0:07
    :END:      
    :PROPERTIES:
    :Effort:   0:15
    :END:
*** DONE LB
    CLOSED: [2017-03-09 Thu 12:32]
    :LOGBOOK:  
    CLOCK: [2017-03-09 Thu 12:21]--[2017-03-09 Thu 12:32] =>  0:11
    :END:      
    :PROPERTIES:
    :Effort:   0:15
    :END:
*** DONE LH
    CLOSED: [2017-03-09 Thu 17:32]
    :LOGBOOK:  
    CLOCK: [2017-03-09 Thu 12:34]--[2017-03-09 Thu 13:04] =>  0:30
    :END:      
    :PROPERTIES:
    :Effort:   0:15
    :END:
*** DONE LW
    CLOSED: [2017-03-09 Thu 18:06]
    :LOGBOOK:  
    CLOCK: [2017-03-09 Thu 17:32]--[2017-03-09 Thu 17:57] =>  0:25
    :END:      
    :PROPERTIES:
    :Effort:   0:15
    :END:
*** DONE SH
    CLOSED: [2017-03-13 Mon 10:32]
    :LOGBOOK:  
    CLOCK: [2017-03-13 Mon 10:13]--[2017-03-13 Mon 10:32] =>  0:19
    :END:      
    :PROPERTIES:
    :Effort:   0:15
    :END:
*** DONE SW
    CLOSED: [2017-03-10 Fri 10:26]
    :LOGBOOK:  
    CLOCK: [2017-03-10 Fri 10:10]--[2017-03-10 Fri 10:26] =>  0:16
    :END:      
    :PROPERTIES:
    :Effort:   0:15
    :END:
*** TODO SLL
    :LOGBOOK:  
    CLOCK: [2017-02-01 Wed 16:33]--[2017-02-01 Wed 17:57] =>  1:24
    :END:      
    :PROPERTIES:
    :Effort:   0:30
    :END:
** DONE add dw to assembler
   CLOSED: [2017-03-10 Fri 10:10]
   :LOGBOOK:  
   CLOCK: [2017-03-09 Thu 18:23]--[2017-03-09 Thu 19:00] =>  0:37
   :END:      
   :PROPERTIES:
   :Effort:   0:30
   :END:
